using System;
using System.Text;

namespace EInfrastructure.Core.HelpCommon
{
    /// <summary>
    /// Æ´Òô°ïÖúÀà
    /// </summary>
    public static class PinYinCommon
    {
        #region Êı×éĞÅÏ¢

        private static readonly int[] PyValue = new int[] 

        {
            -20319, -20317, -20304, -20295, -20292, -20283, -20265, -20257, -20242, 

            -20230, -20051, -20036, -20032, -20026, -20002, -19990, -19986, -19982,

            -19976, -19805, -19784, -19775, -19774, -19763, -19756, -19751, -19746, 

            -19741, -19739, -19728, -19725, -19715, -19540, -19531, -19525, -19515, 

            -19500, -19484, -19479, -19467, -19289, -19288, -19281, -19275, -19270, 

            -19263, -19261, -19249, -19243, -19242, -19238, -19235, -19227, -19224, 

            -19218, -19212, -19038, -19023, -19018, -19006, -19003, -18996, -18977,

            -18961, -18952, -18783, -18774, -18773, -18763, -18756, -18741, -18735, 

            -18731, -18722, -18710, -18697, -18696, -18526, -18518, -18501, -18490,

            -18478, -18463, -18448, -18447, -18446, -18239, -18237, -18231, -18220,

            -18211, -18201, -18184, -18183, -18181, -18012, -17997, -17988, -17970, 

            -17964, -17961, -17950, -17947, -17931, -17928, -17922, -17759, -17752, 

            -17733, -17730, -17721, -17703, -17701, -17697, -17692, -17683, -17676,

            -17496, -17487, -17482, -17468, -17454, -17433, -17427, -17417, -17202, 

            -17185, -16983, -16970, -16942, -16915, -16733, -16708, -16706, -16689, 

            -16664, -16657, -16647, -16474, -16470, -16465, -16459, -16452, -16448, 

            -16433, -16429, -16427, -16423, -16419, -16412, -16407, -16403, -16401, 

            -16393, -16220, -16216, -16212, -16205, -16202, -16187, -16180, -16171,

            -16169, -16158, -16155, -15959, -15958, -15944, -15933, -15920, -15915, 

            -15903, -15889, -15878, -15707, -15701, -15681, -15667, -15661, -15659, 

            -15652, -15640, -15631, -15625, -15454, -15448, -15436, -15435, -15419,

            -15416, -15408, -15394, -15385, -15377, -15375, -15369, -15363, -15362, 

            -15183, -15180, -15165, -15158, -15153, -15150, -15149, -15144, -15143, 

            -15141, -15140, -15139, -15128, -15121, -15119, -15117, -15110, -15109, 

            -14941, -14937, -14933, -14930, -14929, -14928, -14926, -14922, -14921,

            -14914, -14908, -14902, -14894, -14889, -14882, -14873, -14871, -14857, 

            -14678, -14674, -14670, -14668, -14663, -14654, -14645, -14630, -14594,

            -14429, -14407, -14399, -14384, -14379, -14368, -14355, -14353, -14345,

            -14170, -14159, -14151, -14149, -14145, -14140, -14137, -14135, -14125, 

            -14123, -14122, -14112, -14109, -14099, -14097, -14094, -14092, -14090, 

            -14087, -14083, -13917, -13914, -13910, -13907, -13906, -13905, -13896, 

            -13894, -13878, -13870, -13859, -13847, -13831, -13658, -13611, -13601,

            -13406, -13404, -13400, -13398, -13395, -13391, -13387, -13383, -13367, 

            -13359, -13356, -13343, -13340, -13329, -13326, -13318, -13147, -13138, 

            -13120, -13107, -13096, -13095, -13091, -13076, -13068, -13063, -13060, 

            -12888, -12875, -12871, -12860, -12858, -12852, -12849, -12838, -12831,

            -12829, -12812, -12802, -12607, -12597, -12594, -12585, -12556, -12359,

            -12346, -12320, -12300, -12120, -12099, -12089, -12074, -12067, -12058,

            -12039, -11867, -11861, -11847, -11831, -11798, -11781, -11604, -11589, 

            -11536, -11358, -11340, -11339, -11324, -11303, -11097, -11077, -11067,

            -11055, -11052, -11045, -11041, -11038, -11024, -11020, -11019, -11018,

            -11014, -10838, -10832, -10815, -10800, -10790, -10780, -10764, -10587,

            -10544, -10533, -10519, -10331, -10329, -10328, -10322, -10315, -10309, 

            -10307, -10296, -10281, -10274, -10270, -10262, -10260, -10256, -10254 

        };

        private static readonly string[] PyName = new string[]

         { 
             "A", "Ai", "An", "Ang", "Ao", "Ba", "Bai", "Ban", "Bang", "Bao", "Bei", 

             "Ben", "Beng", "Bi", "Bian", "Biao", "Bie", "Bin", "Bing", "Bo", "Bu",

             "Ba", "Cai", "Can", "Cang", "Cao", "Ce", "Ceng", "Cha", "Chai", "Chan",

             "Chang", "Chao", "Che", "Chen", "Cheng", "Chi", "Chong", "Chou", "Chu",

             "Chuai", "Chuan", "Chuang", "Chui", "Chun", "Chuo", "Ci", "Cong", "Cou",

             "Cu", "Cuan", "Cui", "Cun", "Cuo", "Da", "Dai", "Dan", "Dang", "Dao", "De", 

             "Deng", "Di", "Dian", "Diao", "Die", "Ding", "Diu", "Dong", "Dou", "Du", 

             "Duan", "Dui", "Dun", "Duo", "E", "En", "Er", "Fa", "Fan", "Fang", "Fei", 

             "Fen", "Feng", "Fo", "Fou", "Fu", "Ga", "Gai", "Gan", "Gang", "Gao", "Ge", 

             "Gei", "Gen", "Geng", "Gong", "Gou", "Gu", "Gua", "Guai", "Guan", "Guang", 

             "Gui", "Gun", "Guo", "Ha", "Hai", "Han", "Hang", "Hao", "He", "Hei", "Hen", 

             "Heng", "Hong", "Hou", "Hu", "Hua", "Huai", "Huan", "Huang", "Hui", "Hun",

             "Huo", "Ji", "Jia", "Jian", "Jiang", "Jiao", "Jie", "Jin", "Jing", "Jiong", 

             "Jiu", "Ju", "Juan", "Jue", "Jun", "Ka", "Kai", "Kan", "Kang", "Kao", "Ke",

             "Ken", "Keng", "Kong", "Kou", "Ku", "Kua", "Kuai", "Kuan", "Kuang", "Kui", 

             "Kun", "Kuo", "La", "Lai", "Lan", "Lang", "Lao", "Le", "Lei", "Leng", "Li",

             "Lia", "Lian", "Liang", "Liao", "Lie", "Lin", "Ling", "Liu", "Long", "Lou", 

             "Lu", "Lv", "Luan", "Lue", "Lun", "Luo", "Ma", "Mai", "Man", "Mang", "Mao",

             "Me", "Mei", "Men", "Meng", "Mi", "Mian", "Miao", "Mie", "Min", "Ming", "Miu",

             "Mo", "Mou", "Mu", "Na", "Nai", "Nan", "Nang", "Nao", "Ne", "Nei", "Nen", 

             "Neng", "Ni", "Nian", "Niang", "Niao", "Nie", "Nin", "Ning", "Niu", "Nong", 

             "Nu", "Nv", "Nuan", "Nue", "Nuo", "O", "Ou", "Pa", "Pai", "Pan", "Pang",

             "Pao", "Pei", "Pen", "Peng", "Pi", "Pian", "Piao", "Pie", "Pin", "Ping", 

             "Po", "Pu", "Qi", "Qia", "Qian", "Qiang", "Qiao", "Qie", "Qin", "Qing",

             "Qiong", "Qiu", "Qu", "Quan", "Que", "Qun", "Ran", "Rang", "Rao", "Re",

             "Ren", "Reng", "Ri", "Rong", "Rou", "Ru", "Ruan", "Rui", "Run", "Ruo", 

             "Sa", "Sai", "San", "Sang", "Sao", "Se", "Sen", "Seng", "Sha", "Shai", 

             "Shan", "Shang", "Shao", "She", "Shen", "Sheng", "Shi", "Shou", "Shu", 

             "Shua", "Shuai", "Shuan", "Shuang", "Shui", "Shun", "Shuo", "Si", "Song", 

             "Sou", "Su", "Suan", "Sui", "Sun", "Suo", "Ta", "Tai", "Tan", "Tang", 

             "Tao", "Te", "Teng", "Ti", "Tian", "Tiao", "Tie", "Ting", "Tong", "Tou",

             "Tu", "Tuan", "Tui", "Tun", "Tuo", "Wa", "Wai", "Wan", "Wang", "Wei",

             "Wen", "Weng", "Wo", "Wu", "Xi", "Xia", "Xian", "Xiang", "Xiao", "Xie",

             "Xin", "Xing", "Xiong", "Xiu", "Xu", "Xuan", "Xue", "Xun", "Ya", "Yan",

             "Yang", "Yao", "Ye", "Yi", "Yin", "Ying", "Yo", "Yong", "You", "Yu", 

             "Yuan", "Yue", "Yun", "Za", "Zai", "Zan", "Zang", "Zao", "Ze", "Zei",

             "Zen", "Zeng", "Zha", "Zhai", "Zhan", "Zhang", "Zhao", "Zhe", "Zhen", 

             "Zheng", "Zhi", "Zhong", "Zhou", "Zhu", "Zhua", "Zhuai", "Zhuan", 

             "Zhuang", "Zhui", "Zhun", "Zhuo", "Zi", "Zong", "Zou", "Zu", "Zuan",

             "Zui", "Zun", "Zuo" 
         };

        #region ¶ş¼¶ºº×Ö
        /// <summary>
        /// ¶ş¼¶ºº×ÖÊı×é
        /// </summary>
        private static readonly string[] OtherChinese = new string[]
        {
            "Ø¡","Ø¢","Ø£","Ø¤","Ø¥","Ø¦","Ø§","Ø¨","Ø©","Øª","Ø«","Ø¬","Ø­","Ø®","Ø¯"
            ,"Ø°","Ø±","Ø²","Ø³","Ø´","Øµ","Ø¶","Ø·","Ø¸","Ø¹","Øº","Ø»","Ø¼","Ø½","Ø¾","Ø¿"
            ,"ØÀ","ØÁ","ØÂ","ØÃ","ØÄ","ØÅ","ØÆ","ØÇ","ØÈ","ØÉ","ØÊ","ØË","ØÌ","ØÍ","ØÎ","ØÏ"
            ,"ØĞ","ØÑ","ØÒ","ØÓ","ØÔ","ØÕ","ØÖ","Ø×","ØØ","ØÙ","ØÚ","ØÛ","ØÜ","Øİ","ØŞ","Øß"
            ,"Øà","Øá","Øâ","Øã","Øä","Øå","Øæ","Øç","Øè","Øé","Øê","Øë","Øì","Øí","Øî","Øï"
            ,"Øğ","Øñ","Øò","Øó","Øô","Øõ","Øö","Ø÷","Øø","Øù","Øú","Øû","Øü","Øı","Øş"
            ,"Ù¡","Ù¢","Ù£","Ù¤","Ù¥","Ù¦","Ù§","Ù¨","Ù©","Ùª","Ù«","Ù¬","Ù­","Ù®","Ù¯"
            ,"Ù°","Ù±","Ù²","Ù³","Ù´","Ùµ","Ù¶","Ù·","Ù¸","Ù¹","Ùº","Ù»","Ù¼","Ù½","Ù¾","Ù¿"
            ,"ÙÀ","ÙÁ","ÙÂ","ÙÃ","ÙÄ","ÙÅ","ÙÆ","ÙÇ","ÙÈ","ÙÉ","ÙÊ","ÙË","ÙÌ","ÙÍ","ÙÎ","ÙÏ"
            ,"ÙĞ","ÙÑ","ÙÒ","ÙÓ","ÙÔ","ÙÕ","ÙÖ","Ù×","ÙØ","ÙÙ","ÙÚ","ÙÛ","ÙÜ","Ùİ","ÙŞ","Ùß"
            ,"Ùà","Ùá","Ùâ","Ùã","Ùä","Ùå","Ùæ","Ùç","Ùè","Ùé","Ùê","Ùë","Ùì","Ùí","Ùî","Ùï"
            ,"Ùğ","Ùñ","Ùò","Ùó","Ùô","Ùõ","Ùö","Ù÷","Ùø","Ùù","Ùú","Ùû","Ùü","Ùı","Ùş"
            ,"Ú¡","Ú¢","Ú£","Ú¤","Ú¥","Ú¦","Ú§","Ú¨","Ú©","Úª","Ú«","Ú¬","Ú­","Ú®","Ú¯"
            ,"Ú°","Ú±","Ú²","Ú³","Ú´","Úµ","Ú¶","Ú·","Ú¸","Ú¹","Úº","Ú»","Ú¼","Ú½","Ú¾","Ú¿"
            ,"ÚÀ","ÚÁ","ÚÂ","ÚÃ","ÚÄ","ÚÅ","ÚÆ","ÚÇ","ÚÈ","ÚÉ","ÚÊ","ÚË","ÚÌ","ÚÍ","ÚÎ","ÚÏ"
            ,"ÚĞ","ÚÑ","ÚÒ","ÚÓ","ÚÔ","ÚÕ","ÚÖ","Ú×","ÚØ","ÚÙ","ÚÚ","ÚÛ","ÚÜ","Úİ","ÚŞ","Úß"
            ,"Úà","Úá","Úâ","Úã","Úä","Úå","Úæ","Úç","Úè","Úé","Úê","Úë","Úì","Úí","Úî","Úï"
            ,"Úğ","Úñ","Úò","Úó","Úô","Úõ","Úö","Ú÷","Úø","Úù","Úú","Úû","Úü","Úı","Úş"
            ,"Û¡","Û¢","Û£","Û¤","Û¥","Û¦","Û§","Û¨","Û©","Ûª","Û«","Û¬","Û­","Û®","Û¯"
            ,"Û°","Û±","Û²","Û³","Û´","Ûµ","Û¶","Û·","Û¸","Û¹","Ûº","Û»","Û¼","Û½","Û¾","Û¿"
            ,"ÛÀ","ÛÁ","ÛÂ","ÛÃ","ÛÄ","ÛÅ","ÛÆ","ÛÇ","ÛÈ","ÛÉ","ÛÊ","ÛË","ÛÌ","ÛÍ","ÛÎ","ÛÏ"
            ,"ÛĞ","ÛÑ","ÛÒ","ÛÓ","ÛÔ","ÛÕ","ÛÖ","Û×","ÛØ","ÛÙ","ÛÚ","ÛÛ","ÛÜ","Ûİ","ÛŞ","Ûß"
            ,"Ûà","Ûá","Ûâ","Ûã","Ûä","Ûå","Ûæ","Ûç","Ûè","Ûé","Ûê","Ûë","Ûì","Ûí","Ûî","Ûï"
            ,"Ûğ","Ûñ","Ûò","Ûó","Ûô","Ûõ","Ûö","Û÷","Ûø","Ûù","Ûú","Ûû","Ûü","Ûı","Ûş"
            ,"Ü¡","Ü¢","Ü£","Ü¤","Ü¥","Ü¦","Ü§","Ü¨","Ü©","Üª","Ü«","Ü¬","Ü­","Ü®","Ü¯"
            ,"Ü°","Ü±","Ü²","Ü³","Ü´","Üµ","Ü¶","Ü·","Ü¸","Ü¹","Üº","Ü»","Ü¼","Ü½","Ü¾","Ü¿"
            ,"ÜÀ","ÜÁ","ÜÂ","ÜÃ","ÜÄ","ÜÅ","ÜÆ","ÜÇ","ÜÈ","ÜÉ","ÜÊ","ÜË","ÜÌ","ÜÍ","ÜÎ","ÜÏ"
            ,"ÜĞ","ÜÑ","ÜÒ","ÜÓ","ÜÔ","ÜÕ","ÜÖ","Ü×","ÜØ","ÜÙ","ÜÚ","ÜÛ","ÜÜ","Üİ","ÜŞ","Üß"
            ,"Üà","Üá","Üâ","Üã","Üä","Üå","Üæ","Üç","Üè","Üé","Üê","Üë","Üì","Üí","Üî","Üï"
            ,"Üğ","Üñ","Üò","Üó","Üô","Üõ","Üö","Ü÷","Üø","Üù","Üú","Üû","Üü","Üı","Üş"
            ,"İ¡","İ¢","İ£","İ¤","İ¥","İ¦","İ§","İ¨","İ©","İª","İ«","İ¬","İ­","İ®","İ¯"
            ,"İ°","İ±","İ²","İ³","İ´","İµ","İ¶","İ·","İ¸","İ¹","İº","İ»","İ¼","İ½","İ¾","İ¿"
            ,"İÀ","İÁ","İÂ","İÃ","İÄ","İÅ","İÆ","İÇ","İÈ","İÉ","İÊ","İË","İÌ","İÍ","İÎ","İÏ"
            ,"İĞ","İÑ","İÒ","İÓ","İÔ","İÕ","İÖ","İ×","İØ","İÙ","İÚ","İÛ","İÜ","İİ","İŞ","İß"
            ,"İà","İá","İâ","İã","İä","İå","İæ","İç","İè","İé","İê","İë","İì","İí","İî","İï"
            ,"İğ","İñ","İò","İó","İô","İõ","İö","İ÷","İø","İù","İú","İû","İü","İı","İş"
            ,"Ş¡","Ş¢","Ş£","Ş¤","Ş¥","Ş¦","Ş§","Ş¨","Ş©","Şª","Ş«","Ş¬","Ş­","Ş®","Ş¯"
            ,"Ş°","Ş±","Ş²","Ş³","Ş´","Şµ","Ş¶","Ş·","Ş¸","Ş¹","Şº","Ş»","Ş¼","Ş½","Ş¾","Ş¿"
            ,"ŞÀ","ŞÁ","ŞÂ","ŞÃ","ŞÄ","ŞÅ","ŞÆ","ŞÇ","ŞÈ","ŞÉ","ŞÊ","ŞË","ŞÌ","ŞÍ","ŞÎ","ŞÏ"
            ,"ŞĞ","ŞÑ","ŞÒ","ŞÓ","ŞÔ","ŞÕ","ŞÖ","Ş×","ŞØ","ŞÙ","ŞÚ","ŞÛ","ŞÜ","Şİ","ŞŞ","Şß"
            ,"Şà","Şá","Şâ","Şã","Şä","Şå","Şæ","Şç","Şè","Şé","Şê","Şë","Şì","Şí","Şî","Şï"
            ,"Şğ","Şñ","Şò","Şó","Şô","Şõ","Şö","Ş÷","Şø","Şù","Şú","Şû","Şü","Şı","Şş"
            ,"ß¡","ß¢","ß£","ß¤","ß¥","ß¦","ß§","ß¨","ß©","ßª","ß«","ß¬","ß­","ß®","ß¯"
            ,"ß°","ß±","ß²","ß³","ß´","ßµ","ß¶","ß·","ß¸","ß¹","ßº","ß»","ß¼","ß½","ß¾","ß¿"
            ,"ßÀ","ßÁ","ßÂ","ßÃ","ßÄ","ßÅ","ßÆ","ßÇ","ßÈ","ßÉ","ßÊ","ßË","ßÌ","ßÍ","ßÎ","ßÏ"
            ,"ßĞ","ßÑ","ßÒ","ßÓ","ßÔ","ßÕ","ßÖ","ß×","ßØ","ßÙ","ßÚ","ßÛ","ßÜ","ßİ","ßŞ","ßß"
            ,"ßà","ßá","ßâ","ßã","ßä","ßå","ßæ","ßç","ßè","ßé","ßê","ßë","ßì","ßí","ßî","ßï"
            ,"ßğ","ßñ","ßò","ßó","ßô","ßõ","ßö","ß÷","ßø","ßù","ßú","ßû","ßü","ßı","ßş"
            ,"à¡","à¢","à£","à¤","à¥","à¦","à§","à¨","à©","àª","à«","à¬","à­","à®","à¯"
            ,"à°","à±","à²","à³","à´","àµ","à¶","à·","à¸","à¹","àº","à»","à¼","à½","à¾","à¿"
            ,"àÀ","àÁ","àÂ","àÃ","àÄ","àÅ","àÆ","àÇ","àÈ","àÉ","àÊ","àË","àÌ","àÍ","àÎ","àÏ"
            ,"àĞ","àÑ","àÒ","àÓ","àÔ","àÕ","àÖ","à×","àØ","àÙ","àÚ","àÛ","àÜ","àİ","àŞ","àß"
            ,"àà","àá","àâ","àã","àä","àå","àæ","àç","àè","àé","àê","àë","àì","àí","àî","àï"
            ,"àğ","àñ","àò","àó","àô","àõ","àö","à÷","àø","àù","àú","àû","àü","àı","àş"
            ,"á¡","á¢","á£","á¤","á¥","á¦","á§","á¨","á©","áª","á«","á¬","á­","á®","á¯"
            ,"á°","á±","á²","á³","á´","áµ","á¶","á·","á¸","á¹","áº","á»","á¼","á½","á¾","á¿"
            ,"áÀ","áÁ","áÂ","áÃ","áÄ","áÅ","áÆ","áÇ","áÈ","áÉ","áÊ","áË","áÌ","áÍ","áÎ","áÏ"
            ,"áĞ","áÑ","áÒ","áÓ","áÔ","áÕ","áÖ","á×","áØ","áÙ","áÚ","áÛ","áÜ","áİ","áŞ","áß"
            ,"áà","áá","áâ","áã","áä","áå","áæ","áç","áè","áé","áê","áë","áì","áí","áî","áï"
            ,"áğ","áñ","áò","áó","áô","áõ","áö","á÷","áø","áù","áú","áû","áü","áı","áş"
            ,"â¡","â¢","â£","â¤","â¥","â¦","â§","â¨","â©","âª","â«","â¬","â­","â®","â¯"
            ,"â°","â±","â²","â³","â´","âµ","â¶","â·","â¸","â¹","âº","â»","â¼","â½","â¾","â¿"
            ,"âÀ","âÁ","âÂ","âÃ","âÄ","âÅ","âÆ","âÇ","âÈ","âÉ","âÊ","âË","âÌ","âÍ","âÎ","âÏ"
            ,"âĞ","âÑ","âÒ","âÓ","âÔ","âÕ","âÖ","â×","âØ","âÙ","âÚ","âÛ","âÜ","âİ","âŞ","âß"
            ,"âà","âá","ââ","âã","âä","âå","âæ","âç","âè","âé","âê","âë","âì","âí","âî","âï"
            ,"âğ","âñ","âò","âó","âô","âõ","âö","â÷","âø","âù","âú","âû","âü","âı","âş"
            ,"ã¡","ã¢","ã£","ã¤","ã¥","ã¦","ã§","ã¨","ã©","ãª","ã«","ã¬","ã­","ã®","ã¯"
            ,"ã°","ã±","ã²","ã³","ã´","ãµ","ã¶","ã·","ã¸","ã¹","ãº","ã»","ã¼","ã½","ã¾","ã¿"
            ,"ãÀ","ãÁ","ãÂ","ãÃ","ãÄ","ãÅ","ãÆ","ãÇ","ãÈ","ãÉ","ãÊ","ãË","ãÌ","ãÍ","ãÎ","ãÏ"
            ,"ãĞ","ãÑ","ãÒ","ãÓ","ãÔ","ãÕ","ãÖ","ã×","ãØ","ãÙ","ãÚ","ãÛ","ãÜ","ãİ","ãŞ","ãß"
            ,"ãà","ãá","ãâ","ãã","ãä","ãå","ãæ","ãç","ãè","ãé","ãê","ãë","ãì","ãí","ãî","ãï"
            ,"ãğ","ãñ","ãò","ãó","ãô","ãõ","ãö","ã÷","ãø","ãù","ãú","ãû","ãü","ãı","ãş"
            ,"ä¡","ä¢","ä£","ä¤","ä¥","ä¦","ä§","ä¨","ä©","äª","ä«","ä¬","ä­","ä®","ä¯"
            ,"ä°","ä±","ä²","ä³","ä´","äµ","ä¶","ä·","ä¸","ä¹","äº","ä»","ä¼","ä½","ä¾","ä¿"
            ,"äÀ","äÁ","äÂ","äÃ","äÄ","äÅ","äÆ","äÇ","äÈ","äÉ","äÊ","äË","äÌ","äÍ","äÎ","äÏ"
            ,"äĞ","äÑ","äÒ","äÓ","äÔ","äÕ","äÖ","ä×","äØ","äÙ","äÚ","äÛ","äÜ","äİ","äŞ","äß"
            ,"äà","äá","äâ","äã","ää","äå","äæ","äç","äè","äé","äê","äë","äì","äí","äî","äï"
            ,"äğ","äñ","äò","äó","äô","äõ","äö","ä÷","äø","äù","äú","äû","äü","äı","äş"
            ,"å¡","å¢","å£","å¤","å¥","å¦","å§","å¨","å©","åª","å«","å¬","å­","å®","å¯"
            ,"å°","å±","å²","å³","å´","åµ","å¶","å·","å¸","å¹","åº","å»","å¼","å½","å¾","å¿"
            ,"åÀ","åÁ","åÂ","åÃ","åÄ","åÅ","åÆ","åÇ","åÈ","åÉ","åÊ","åË","åÌ","åÍ","åÎ","åÏ"
            ,"åĞ","åÑ","åÒ","åÓ","åÔ","åÕ","åÖ","å×","åØ","åÙ","åÚ","åÛ","åÜ","åİ","åŞ","åß"
            ,"åà","åá","åâ","åã","åä","åå","åæ","åç","åè","åé","åê","åë","åì","åí","åî","åï"
            ,"åğ","åñ","åò","åó","åô","åõ","åö","å÷","åø","åù","åú","åû","åü","åı","åş"
            ,"æ¡","æ¢","æ£","æ¤","æ¥","æ¦","æ§","æ¨","æ©","æª","æ«","æ¬","æ­","æ®","æ¯"
            ,"æ°","æ±","æ²","æ³","æ´","æµ","æ¶","æ·","æ¸","æ¹","æº","æ»","æ¼","æ½","æ¾","æ¿"
            ,"æÀ","æÁ","æÂ","æÃ","æÄ","æÅ","æÆ","æÇ","æÈ","æÉ","æÊ","æË","æÌ","æÍ","æÎ","æÏ"
            ,"æĞ","æÑ","æÒ","æÓ","æÔ","æÕ","æÖ","æ×","æØ","æÙ","æÚ","æÛ","æÜ","æİ","æŞ","æß"
            ,"æà","æá","æâ","æã","æä","æå","ææ","æç","æè","æé","æê","æë","æì","æí","æî","æï"
            ,"æğ","æñ","æò","æó","æô","æõ","æö","æ÷","æø","æù","æú","æû","æü","æı","æş"
            ,"ç¡","ç¢","ç£","ç¤","ç¥","ç¦","ç§","ç¨","ç©","çª","ç«","ç¬","ç­","ç®","ç¯"
            ,"ç°","ç±","ç²","ç³","ç´","çµ","ç¶","ç·","ç¸","ç¹","çº","ç»","ç¼","ç½","ç¾","ç¿"
            ,"çÀ","çÁ","çÂ","çÃ","çÄ","çÅ","çÆ","çÇ","çÈ","çÉ","çÊ","çË","çÌ","çÍ","çÎ","çÏ"
            ,"çĞ","çÑ","çÒ","çÓ","çÔ","çÕ","çÖ","ç×","çØ","çÙ","çÚ","çÛ","çÜ","çİ","çŞ","çß"
            ,"çà","çá","çâ","çã","çä","çå","çæ","çç","çè","çé","çê","çë","çì","çí","çî","çï"
            ,"çğ","çñ","çò","çó","çô","çõ","çö","ç÷","çø","çù","çú","çû","çü","çı","çş"
            ,"è¡","è¢","è£","è¤","è¥","è¦","è§","è¨","è©","èª","è«","è¬","è­","è®","è¯"
            ,"è°","è±","è²","è³","è´","èµ","è¶","è·","è¸","è¹","èº","è»","è¼","è½","è¾","è¿"
            ,"èÀ","èÁ","èÂ","èÃ","èÄ","èÅ","èÆ","èÇ","èÈ","èÉ","èÊ","èË","èÌ","èÍ","èÎ","èÏ"
            ,"èĞ","èÑ","èÒ","èÓ","èÔ","èÕ","èÖ","è×","èØ","èÙ","èÚ","èÛ","èÜ","èİ","èŞ","èß"
            ,"èà","èá","èâ","èã","èä","èå","èæ","èç","èè","èé","èê","èë","èì","èí","èî","èï"
            ,"èğ","èñ","èò","èó","èô","èõ","èö","è÷","èø","èù","èú","èû","èü","èı","èş"
            ,"é¡","é¢","é£","é¤","é¥","é¦","é§","é¨","é©","éª","é«","é¬","é­","é®","é¯"
            ,"é°","é±","é²","é³","é´","éµ","é¶","é·","é¸","é¹","éº","é»","é¼","é½","é¾","é¿"
            ,"éÀ","éÁ","éÂ","éÃ","éÄ","éÅ","éÆ","éÇ","éÈ","éÉ","éÊ","éË","éÌ","éÍ","éÎ","éÏ"
            ,"éĞ","éÑ","éÒ","éÓ","éÔ","éÕ","éÖ","é×","éØ","éÙ","éÚ","éÛ","éÜ","éİ","éŞ","éß"
            ,"éà","éá","éâ","éã","éä","éå","éæ","éç","éè","éé","éê","éë","éì","éí","éî","éï"
            ,"éğ","éñ","éò","éó","éô","éõ","éö","é÷","éø","éù","éú","éû","éü","éı","éş"
            ,"ê¡","ê¢","ê£","ê¤","ê¥","ê¦","ê§","ê¨","ê©","êª","ê«","ê¬","ê­","ê®","ê¯"
            ,"ê°","ê±","ê²","ê³","ê´","êµ","ê¶","ê·","ê¸","ê¹","êº","ê»","ê¼","ê½","ê¾","ê¿"
            ,"êÀ","êÁ","êÂ","êÃ","êÄ","êÅ","êÆ","êÇ","êÈ","êÉ","êÊ","êË","êÌ","êÍ","êÎ","êÏ"
            ,"êĞ","êÑ","êÒ","êÓ","êÔ","êÕ","êÖ","ê×","êØ","êÙ","êÚ","êÛ","êÜ","êİ","êŞ","êß"
            ,"êà","êá","êâ","êã","êä","êå","êæ","êç","êè","êé","êê","êë","êì","êí","êî","êï"
            ,"êğ","êñ","êò","êó","êô","êõ","êö","ê÷","êø","êù","êú","êû","êü","êı","êş"
            ,"ë¡","ë¢","ë£","ë¤","ë¥","ë¦","ë§","ë¨","ë©","ëª","ë«","ë¬","ë­","ë®","ë¯"
            ,"ë°","ë±","ë²","ë³","ë´","ëµ","ë¶","ë·","ë¸","ë¹","ëº","ë»","ë¼","ë½","ë¾","ë¿"
            ,"ëÀ","ëÁ","ëÂ","ëÃ","ëÄ","ëÅ","ëÆ","ëÇ","ëÈ","ëÉ","ëÊ","ëË","ëÌ","ëÍ","ëÎ","ëÏ"
            ,"ëĞ","ëÑ","ëÒ","ëÓ","ëÔ","ëÕ","ëÖ","ë×","ëØ","ëÙ","ëÚ","ëÛ","ëÜ","ëİ","ëŞ","ëß"
            ,"ëà","ëá","ëâ","ëã","ëä","ëå","ëæ","ëç","ëè","ëé","ëê","ëë","ëì","ëí","ëî","ëï"
            ,"ëğ","ëñ","ëò","ëó","ëô","ëõ","ëö","ë÷","ëø","ëù","ëú","ëû","ëü","ëı","ëş"
            ,"ì¡","ì¢","ì£","ì¤","ì¥","ì¦","ì§","ì¨","ì©","ìª","ì«","ì¬","ì­","ì®","ì¯"
            ,"ì°","ì±","ì²","ì³","ì´","ìµ","ì¶","ì·","ì¸","ì¹","ìº","ì»","ì¼","ì½","ì¾","ì¿"
            ,"ìÀ","ìÁ","ìÂ","ìÃ","ìÄ","ìÅ","ìÆ","ìÇ","ìÈ","ìÉ","ìÊ","ìË","ìÌ","ìÍ","ìÎ","ìÏ"
            ,"ìĞ","ìÑ","ìÒ","ìÓ","ìÔ","ìÕ","ìÖ","ì×","ìØ","ìÙ","ìÚ","ìÛ","ìÜ","ìİ","ìŞ","ìß"
            ,"ìà","ìá","ìâ","ìã","ìä","ìå","ìæ","ìç","ìè","ìé","ìê","ìë","ìì","ìí","ìî","ìï"
            ,"ìğ","ìñ","ìò","ìó","ìô","ìõ","ìö","ì÷","ìø","ìù","ìú","ìû","ìü","ìı","ìş"
            ,"í¡","í¢","í£","í¤","í¥","í¦","í§","í¨","í©","íª","í«","í¬","í­","í®","í¯"
            ,"í°","í±","í²","í³","í´","íµ","í¶","í·","í¸","í¹","íº","í»","í¼","í½","í¾","í¿"
            ,"íÀ","íÁ","íÂ","íÃ","íÄ","íÅ","íÆ","íÇ","íÈ","íÉ","íÊ","íË","íÌ","íÍ","íÎ","íÏ"
            ,"íĞ","íÑ","íÒ","íÓ","íÔ","íÕ","íÖ","í×","íØ","íÙ","íÚ","íÛ","íÜ","íİ","íŞ","íß"
            ,"íà","íá","íâ","íã","íä","íå","íæ","íç","íè","íé","íê","íë","íì","íí","íî","íï"
            ,"íğ","íñ","íò","íó","íô","íõ","íö","í÷","íø","íù","íú","íû","íü","íı","íş"
            ,"î¡","î¢","î£","î¤","î¥","î¦","î§","î¨","î©","îª","î«","î¬","î­","î®","î¯"
            ,"î°","î±","î²","î³","î´","îµ","î¶","î·","î¸","î¹","îº","î»","î¼","î½","î¾","î¿"
            ,"îÀ","îÁ","îÂ","îÃ","îÄ","îÅ","îÆ","îÇ","îÈ","îÉ","îÊ","îË","îÌ","îÍ","îÎ","îÏ"
            ,"îĞ","îÑ","îÒ","îÓ","îÔ","îÕ","îÖ","î×","îØ","îÙ","îÚ","îÛ","îÜ","îİ","îŞ","îß"
            ,"îà","îá","îâ","îã","îä","îå","îæ","îç","îè","îé","îê","îë","îì","îí","îî","îï"
            ,"îğ","îñ","îò","îó","îô","îõ","îö","î÷","îø","îù","îú","îû","îü","îı","îş"
            ,"ï¡","ï¢","ï£","ï¤","ï¥","ï¦","ï§","ï¨","ï©","ïª","ï«","ï¬","ï­","ï®","ï¯"
            ,"ï°","ï±","ï²","ï³","ï´","ïµ","ï¶","ï·","ï¸","ï¹","ïº","ï»","ï¼","ï½","ï¾","ï¿"
            ,"ïÀ","ïÁ","ïÂ","ïÃ","ïÄ","ïÅ","ïÆ","ïÇ","ïÈ","ïÉ","ïÊ","ïË","ïÌ","ïÍ","ïÎ","ïÏ"
            ,"ïĞ","ïÑ","ïÒ","ïÓ","ïÔ","ïÕ","ïÖ","ï×","ïØ","ïÙ","ïÚ","ïÛ","ïÜ","ïİ","ïŞ","ïß"
            ,"ïà","ïá","ïâ","ïã","ïä","ïå","ïæ","ïç","ïè","ïé","ïê","ïë","ïì","ïí","ïî","ïï"
            ,"ïğ","ïñ","ïò","ïó","ïô","ïõ","ïö","ï÷","ïø","ïù","ïú","ïû","ïü","ïı","ïş"
            ,"ğ¡","ğ¢","ğ£","ğ¤","ğ¥","ğ¦","ğ§","ğ¨","ğ©","ğª","ğ«","ğ¬","ğ­","ğ®","ğ¯"
            ,"ğ°","ğ±","ğ²","ğ³","ğ´","ğµ","ğ¶","ğ·","ğ¸","ğ¹","ğº","ğ»","ğ¼","ğ½","ğ¾","ğ¿"
            ,"ğÀ","ğÁ","ğÂ","ğÃ","ğÄ","ğÅ","ğÆ","ğÇ","ğÈ","ğÉ","ğÊ","ğË","ğÌ","ğÍ","ğÎ","ğÏ"
            ,"ğĞ","ğÑ","ğÒ","ğÓ","ğÔ","ğÕ","ğÖ","ğ×","ğØ","ğÙ","ğÚ","ğÛ","ğÜ","ğİ","ğŞ","ğß"
            ,"ğà","ğá","ğâ","ğã","ğä","ğå","ğæ","ğç","ğè","ğé","ğê","ğë","ğì","ğí","ğî","ğï"
            ,"ğğ","ğñ","ğò","ğó","ğô","ğõ","ğö","ğ÷","ğø","ğù","ğú","ğû","ğü","ğı","ğş"
            ,"ñ¡","ñ¢","ñ£","ñ¤","ñ¥","ñ¦","ñ§","ñ¨","ñ©","ñª","ñ«","ñ¬","ñ­","ñ®","ñ¯"
            ,"ñ°","ñ±","ñ²","ñ³","ñ´","ñµ","ñ¶","ñ·","ñ¸","ñ¹","ñº","ñ»","ñ¼","ñ½","ñ¾","ñ¿"
            ,"ñÀ","ñÁ","ñÂ","ñÃ","ñÄ","ñÅ","ñÆ","ñÇ","ñÈ","ñÉ","ñÊ","ñË","ñÌ","ñÍ","ñÎ","ñÏ"
            ,"ñĞ","ñÑ","ñÒ","ñÓ","ñÔ","ñÕ","ñÖ","ñ×","ñØ","ñÙ","ñÚ","ñÛ","ñÜ","ñİ","ñŞ","ñß"
            ,"ñà","ñá","ñâ","ñã","ñä","ñå","ñæ","ñç","ñè","ñé","ñê","ñë","ñì","ñí","ñî","ñï"
            ,"ñğ","ññ","ñò","ñó","ñô","ñõ","ñö","ñ÷","ñø","ñù","ñú","ñû","ñü","ñı","ñş"
            ,"ò¡","ò¢","ò£","ò¤","ò¥","ò¦","ò§","ò¨","ò©","òª","ò«","ò¬","ò­","ò®","ò¯"
            ,"ò°","ò±","ò²","ò³","ò´","òµ","ò¶","ò·","ò¸","ò¹","òº","ò»","ò¼","ò½","ò¾","ò¿"
            ,"òÀ","òÁ","òÂ","òÃ","òÄ","òÅ","òÆ","òÇ","òÈ","òÉ","òÊ","òË","òÌ","òÍ","òÎ","òÏ"
            ,"òĞ","òÑ","òÒ","òÓ","òÔ","òÕ","òÖ","ò×","òØ","òÙ","òÚ","òÛ","òÜ","òİ","òŞ","òß"
            ,"òà","òá","òâ","òã","òä","òå","òæ","òç","òè","òé","òê","òë","òì","òí","òî","òï"
            ,"òğ","òñ","òò","òó","òô","òõ","òö","ò÷","òø","òù","òú","òû","òü","òı","òş"
            ,"ó¡","ó¢","ó£","ó¤","ó¥","ó¦","ó§","ó¨","ó©","óª","ó«","ó¬","ó­","ó®","ó¯"
            ,"ó°","ó±","ó²","ó³","ó´","óµ","ó¶","ó·","ó¸","ó¹","óº","ó»","ó¼","ó½","ó¾","ó¿"
            ,"óÀ","óÁ","óÂ","óÃ","óÄ","óÅ","óÆ","óÇ","óÈ","óÉ","óÊ","óË","óÌ","óÍ","óÎ","óÏ"
            ,"óĞ","óÑ","óÒ","óÓ","óÔ","óÕ","óÖ","ó×","óØ","óÙ","óÚ","óÛ","óÜ","óİ","óŞ","óß"
            ,"óà","óá","óâ","óã","óä","óå","óæ","óç","óè","óé","óê","óë","óì","óí","óî","óï"
            ,"óğ","óñ","óò","óó","óô","óõ","óö","ó÷","óø","óù","óú","óû","óü","óı","óş"
            ,"ô¡","ô¢","ô£","ô¤","ô¥","ô¦","ô§","ô¨","ô©","ôª","ô«","ô¬","ô­","ô®","ô¯"
            ,"ô°","ô±","ô²","ô³","ô´","ôµ","ô¶","ô·","ô¸","ô¹","ôº","ô»","ô¼","ô½","ô¾","ô¿"
            ,"ôÀ","ôÁ","ôÂ","ôÃ","ôÄ","ôÅ","ôÆ","ôÇ","ôÈ","ôÉ","ôÊ","ôË","ôÌ","ôÍ","ôÎ","ôÏ"
            ,"ôĞ","ôÑ","ôÒ","ôÓ","ôÔ","ôÕ","ôÖ","ô×","ôØ","ôÙ","ôÚ","ôÛ","ôÜ","ôİ","ôŞ","ôß"
            ,"ôà","ôá","ôâ","ôã","ôä","ôå","ôæ","ôç","ôè","ôé","ôê","ôë","ôì","ôí","ôî","ôï"
            ,"ôğ","ôñ","ôò","ôó","ôô","ôõ","ôö","ô÷","ôø","ôù","ôú","ôû","ôü","ôı","ôş"
            ,"õ¡","õ¢","õ£","õ¤","õ¥","õ¦","õ§","õ¨","õ©","õª","õ«","õ¬","õ­","õ®","õ¯"
            ,"õ°","õ±","õ²","õ³","õ´","õµ","õ¶","õ·","õ¸","õ¹","õº","õ»","õ¼","õ½","õ¾","õ¿"
            ,"õÀ","õÁ","õÂ","õÃ","õÄ","õÅ","õÆ","õÇ","õÈ","õÉ","õÊ","õË","õÌ","õÍ","õÎ","õÏ"
            ,"õĞ","õÑ","õÒ","õÓ","õÔ","õÕ","õÖ","õ×","õØ","õÙ","õÚ","õÛ","õÜ","õİ","õŞ","õß"
            ,"õà","õá","õâ","õã","õä","õå","õæ","õç","õè","õé","õê","õë","õì","õí","õî","õï"
            ,"õğ","õñ","õò","õó","õô","õõ","õö","õ÷","õø","õù","õú","õû","õü","õı","õş"
            ,"ö¡","ö¢","ö£","ö¤","ö¥","ö¦","ö§","ö¨","ö©","öª","ö«","ö¬","ö­","ö®","ö¯"
            ,"ö°","ö±","ö²","ö³","ö´","öµ","ö¶","ö·","ö¸","ö¹","öº","ö»","ö¼","ö½","ö¾","ö¿"
            ,"öÀ","öÁ","öÂ","öÃ","öÄ","öÅ","öÆ","öÇ","öÈ","öÉ","öÊ","öË","öÌ","öÍ","öÎ","öÏ"
            ,"öĞ","öÑ","öÒ","öÓ","öÔ","öÕ","öÖ","ö×","öØ","öÙ","öÚ","öÛ","öÜ","öİ","öŞ","öß"
            ,"öà","öá","öâ","öã","öä","öå","öæ","öç","öè","öé","öê","öë","öì","öí","öî","öï"
            ,"öğ","öñ","öò","öó","öô","öõ","öö","ö÷","öø","öù","öú","öû","öü","öı","öş"
            ,"÷¡","÷¢","÷£","÷¤","÷¥","÷¦","÷§","÷¨","÷©","÷ª","÷«","÷¬","÷­","÷®","÷¯"
            ,"÷°","÷±","÷²","÷³","÷´","÷µ","÷¶","÷·","÷¸","÷¹","÷º","÷»","÷¼","÷½","÷¾","÷¿"
            ,"÷À","÷Á","÷Â","÷Ã","÷Ä","÷Å","÷Æ","÷Ç","÷È","÷É","÷Ê","÷Ë","÷Ì","÷Í","÷Î","÷Ï"
            ,"÷Ğ","÷Ñ","÷Ò","÷Ó","÷Ô","÷Õ","÷Ö","÷×","÷Ø","÷Ù","÷Ú","÷Û","÷Ü","÷İ","÷Ş","÷ß"
            ,"÷à","÷á","÷â","÷ã","÷ä","÷å","÷æ","÷ç","÷è","÷é","÷ê","÷ë","÷ì","÷í","÷î","÷ï"
            ,"÷ğ","÷ñ","÷ò","÷ó","÷ô","÷õ","÷ö","÷÷","÷ø","÷ù","÷ú","÷û","÷ü","÷ı","÷ş"
        };

        /// <summary>
        /// ¶ş¼¶ºº×Ö¶ÔÓ¦Æ´ÒôÊı×é
        /// </summary>
        private static readonly string[] OtherPinYin = new string[]
           {                         
               "Chu","Ji","Wu","Gai","Nian","Sa","Pi","Gen","Cheng","Ge","Nao","E","Shu","Yu","Pie","Bi",
                "Tuo","Yao","Yao","Zhi","Di","Xin","Yin","Kui","Yu","Gao","Tao","Dian","Ji","Nai","Nie","Ji",
                "Qi","Mi","Bei","Se","Gu","Ze","She","Cuo","Yan","Jue","Si","Ye","Yan","Fang","Po","Gui",
                "Kui","Bian","Ze","Gua","You","Ce","Yi","Wen","Jing","Ku","Gui","Kai","La","Ji","Yan","Wan",
                "Kuai","Piao","Jue","Qiao","Huo","Yi","Tong","Wang","Dan","Ding","Zhang","Le","Sa","Yi","Mu","Ren",
                "Yu","Pi","Ya","Wa","Wu","Chang","Cang","Kang","Zhu","Ning","Ka","You","Yi","Gou","Tong","Tuo",
                "Ni","Ga","Ji","Er","You","Kua","Kan","Zhu","Yi","Tiao","Chai","Jiao","Nong","Mou","Chou","Yan",
                "Li","Qiu","Li","Yu","Ping","Yong","Si","Feng","Qian","Ruo","Pai","Zhuo","Shu","Luo","Wo","Bi",
                "Ti","Guan","Kong","Ju","Fen","Yan","Xie","Ji","Wei","Zong","Lou","Tang","Bin","Nuo","Chi","Xi",
                "Jing","Jian","Jiao","Jiu","Tong","Xuan","Dan","Tong","Tun","She","Qian","Zu","Yue","Cuan","Di","Xi",
                "Xun","Hong","Guo","Chan","Kui","Bao","Pu","Hong","Fu","Fu","Su","Si","Wen","Yan","Bo","Gun",
                "Mao","Xie","Luan","Pou","Bing","Ying","Luo","Lei","Liang","Hu","Lie","Xian","Song","Ping","Zhong","Ming",
                "Yan","Jie","Hong","Shan","Ou","Ju","Ne","Gu","He","Di","Zhao","Qu","Dai","Kuang","Lei","Gua",
                "Jie","Hui","Shen","Gou","Quan","Zheng","Hun","Xu","Qiao","Gao","Kuang","Ei","Zou","Zhuo","Wei","Yu",
                "Shen","Chan","Sui","Chen","Jian","Xue","Ye","E","Yu","Xuan","An","Di","Zi","Pian","Mo","Dang",
                "Su","Shi","Mi","Zhe","Jian","Zen","Qiao","Jue","Yan","Zhan","Chen","Dan","Jin","Zuo","Wu","Qian",
                "Jing","Ban","Yan","Zuo","Bei","Jing","Gai","Zhi","Nie","Zou","Chui","Pi","Wei","Huang","Wei","Xi",
                "Han","Qiong","Kuang","Mang","Wu","Fang","Bing","Pi","Bei","Ye","Di","Tai","Jia","Zhi","Zhu","Kuai",
                "Qie","Xun","Yun","Li","Ying","Gao","Xi","Fu","Pi","Tan","Yan","Juan","Yan","Yin","Zhang","Po",
                "Shan","Zou","Ling","Feng","Chu","Huan","Mai","Qu","Shao","He","Ge","Meng","Xu","Xie","Sou","Xie",
                "Jue","Jian","Qian","Dang","Chang","Si","Bian","Ben","Qiu","Ben","E","Fa","Shu","Ji","Yong","He",
                "Wei","Wu","Ge","Zhen","Kuang","Pi","Yi","Li","Qi","Ban","Gan","Long","Dian","Lu","Che","Di",
                "Tuo","Ni","Mu","Ao","Ya","Die","Dong","Kai","Shan","Shang","Nao","Gai","Yin","Cheng","Shi","Guo",
                "Xun","Lie","Yuan","Zhi","An","Yi","Pi","Nian","Peng","Tu","Sao","Dai","Ku","Die","Yin","Leng",
                "Hou","Ge","Yuan","Man","Yong","Liang","Chi","Xin","Pi","Yi","Cao","Jiao","Nai","Du","Qian","Ji",
                "Wan","Xiong","Qi","Xiang","Fu","Yuan","Yun","Fei","Ji","Li","E","Ju","Pi","Zhi","Rui","Xian",
                "Chang","Cong","Qin","Wu","Qian","Qi","Shan","Bian","Zhu","Kou","Yi","Mo","Gan","Pie","Long","Ba",
                "Mu","Ju","Ran","Qing","Chi","Fu","Ling","Niao","Yin","Mao","Ying","Qiong","Min","Tiao","Qian","Yi",
                "Rao","Bi","Zi","Ju","Tong","Hui","Zhu","Ting","Qiao","Fu","Ren","Xing","Quan","Hui","Xun","Ming",
                "Qi","Jiao","Chong","Jiang","Luo","Ying","Qian","Gen","Jin","Mai","Sun","Hong","Zhou","Kan","Bi","Shi",
                "Wo","You","E","Mei","You","Li","Tu","Xian","Fu","Sui","You","Di","Shen","Guan","Lang","Ying",
                "Chun","Jing","Qi","Xi","Song","Jin","Nai","Qi","Ba","Shu","Chang","Tie","Yu","Huan","Bi","Fu",
                "Tu","Dan","Cui","Yan","Zu","Dang","Jian","Wan","Ying","Gu","Han","Qia","Feng","Shen","Xiang","Wei",
                "Chan","Kai","Qi","Kui","Xi","E","Bao","Pa","Ting","Lou","Pai","Xuan","Jia","Zhen","Shi","Ru",
                "Mo","En","Bei","Weng","Hao","Ji","Li","Bang","Jian","Shuo","Lang","Ying","Yu","Su","Meng","Dou",
                "Xi","Lian","Cu","Lin","Qu","Kou","Xu","Liao","Hui","Xun","Jue","Rui","Zui","Ji","Meng","Fan",
                "Qi","Hong","Xie","Hong","Wei","Yi","Weng","Sou","Bi","Hao","Tai","Ru","Xun","Xian","Gao","Li",
                "Huo","Qu","Heng","Fan","Nie","Mi","Gong","Yi","Kuang","Lian","Da","Yi","Xi","Zang","Pao","You",
                "Liao","Ga","Gan","Ti","Men","Tuan","Chen","Fu","Pin","Niu","Jie","Jiao","Za","Yi","Lv","Jun",
                "Tian","Ye","Ai","Na","Ji","Guo","Bai","Ju","Pou","Lie","Qian","Guan","Die","Zha","Ya","Qin",
                "Yu","An","Xuan","Bing","Kui","Yuan","Shu","En","Chuai","Jian","Shuo","Zhan","Nuo","Sang","Luo","Ying",
                "Zhi","Han","Zhe","Xie","Lu","Zun","Cuan","Gan","Huan","Pi","Xing","Zhuo","Huo","Zuan","Nang","Yi",
                "Te","Dai","Shi","Bu","Chi","Ji","Kou","Dao","Le","Zha","A","Yao","Fu","Mu","Yi","Tai",
                "Li","E","Bi","Bei","Guo","Qin","Yin","Za","Ka","Ga","Gua","Ling","Dong","Ning","Duo","Nao",
                "You","Si","Kuang","Ji","Shen","Hui","Da","Lie","Yi","Xiao","Bi","Ci","Guang","Yue","Xiu","Yi",
                "Pai","Kuai","Duo","Ji","Mie","Mi","Zha","Nong","Gen","Mou","Mai","Chi","Lao","Geng","En","Zha",
                "Suo","Zao","Xi","Zuo","Ji","Feng","Ze","Nuo","Miao","Lin","Zhuan","Zhou","Tao","Hu","Cui","Sha",
                "Yo","Dan","Bo","Ding","Lang","Li","Shua","Chuo","Die","Da","Nan","Li","Kui","Jie","Yong","Kui",
                "Jiu","Sou","Yin","Chi","Jie","Lou","Ku","Wo","Hui","Qin","Ao","Su","Du","Ke","Nie","He",
                "Chen","Suo","Ge","A","En","Hao","Dia","Ai","Ai","Suo","Hei","Tong","Chi","Pei","Lei","Cao",
                "Piao","Qi","Ying","Beng","Sou","Di","Mi","Peng","Jue","Liao","Pu","Chuai","Jiao","O","Qin","Lu",
                "Ceng","Deng","Hao","Jin","Jue","Yi","Sai","Pi","Ru","Cha","Huo","Nang","Wei","Jian","Nan","Lun",
                "Hu","Ling","You","Yu","Qing","Yu","Huan","Wei","Zhi","Pei","Tang","Dao","Ze","Guo","Wei","Wo",
                "Man","Zhang","Fu","Fan","Ji","Qi","Qian","Qi","Qu","Ya","Xian","Ao","Cen","Lan","Ba","Hu",
                "Ke","Dong","Jia","Xiu","Dai","Gou","Mao","Min","Yi","Dong","Qiao","Xun","Zheng","Lao","Lai","Song",
                "Yan","Gu","Xiao","Guo","Kong","Jue","Rong","Yao","Wai","Zai","Wei","Yu","Cuo","Lou","Zi","Mei",
                "Sheng","Song","Ji","Zhang","Lin","Deng","Bin","Yi","Dian","Chi","Pang","Cu","Xun","Yang","Hou","Lai",
                "Xi","Chang","Huang","Yao","Zheng","Jiao","Qu","San","Fan","Qiu","An","Guang","Ma","Niu","Yun","Xia",
                "Pao","Fei","Rong","Kuai","Shou","Sun","Bi","Juan","Li","Yu","Xian","Yin","Suan","Yi","Guo","Luo",
                "Ni","She","Cu","Mi","Hu","Cha","Wei","Wei","Mei","Nao","Zhang","Jing","Jue","Liao","Xie","Xun",
                "Huan","Chuan","Huo","Sun","Yin","Dong","Shi","Tang","Tun","Xi","Ren","Yu","Chi","Yi","Xiang","Bo",
                "Yu","Hun","Zha","Sou","Mo","Xiu","Jin","San","Zhuan","Nang","Pi","Wu","Gui","Pao","Xiu","Xiang",
                "Tuo","An","Yu","Bi","Geng","Ao","Jin","Chan","Xie","Lin","Ying","Shu","Dao","Cun","Chan","Wu",
                "Zhi","Ou","Chong","Wu","Kai","Chang","Chuang","Song","Bian","Niu","Hu","Chu","Peng","Da","Yang","Zuo",
                "Ni","Fu","Chao","Yi","Yi","Tong","Yan","Ce","Kai","Xun","Ke","Yun","Bei","Song","Qian","Kui",
                "Kun","Yi","Ti","Quan","Qie","Xing","Fei","Chang","Wang","Chou","Hu","Cui","Yun","Kui","E","Leng",
                "Zhui","Qiao","Bi","Su","Qie","Yong","Jing","Qiao","Chong","Chu","Lin","Meng","Tian","Hui","Shuan","Yan",
                "Wei","Hong","Min","Kang","Ta","Lv","Kun","Jiu","Lang","Yu","Chang","Xi","Wen","Hun","E","Qu",
                "Que","He","Tian","Que","Kan","Jiang","Pan","Qiang","San","Qi","Si","Cha","Feng","Yuan","Mu","Mian",
                "Dun","Mi","Gu","Bian","Wen","Hang","Wei","Le","Gan","Shu","Long","Lu","Yang","Si","Duo","Ling",
                "Mao","Luo","Xuan","Pan","Duo","Hong","Min","Jing","Huan","Wei","Lie","Jia","Zhen","Yin","Hui","Zhu",
                "Ji","Xu","Hui","Tao","Xun","Jiang","Liu","Hu","Xun","Ru","Su","Wu","Lai","Wei","Zhuo","Juan",
                "Cen","Bang","Xi","Mei","Huan","Zhu","Qi","Xi","Song","Du","Zhuo","Pei","Mian","Gan","Fei","Cong",
                "Shen","Guan","Lu","Shuan","Xie","Yan","Mian","Qiu","Sou","Huang","Xu","Pen","Jian","Xuan","Wo","Mei",
                "Yan","Qin","Ke","She","Mang","Ying","Pu","Li","Ru","Ta","Hun","Bi","Xiu","Fu","Tang","Pang",
                "Ming","Huang","Ying","Xiao","Lan","Cao","Hu","Luo","Huan","Lian","Zhu","Yi","Lu","Xuan","Gan","Shu",
                "Si","Shan","Shao","Tong","Chan","Lai","Sui","Li","Dan","Chan","Lian","Ru","Pu","Bi","Hao","Zhuo",
                "Han","Xie","Ying","Yue","Fen","Hao","Ba","Bao","Gui","Dang","Mi","You","Chen","Ning","Jian","Qian",
                "Wu","Liao","Qian","Huan","Jian","Jian","Zou","Ya","Wu","Jiong","Ze","Yi","Er","Jia","Jing","Dai",
                "Hou","Pang","Bu","Li","Qiu","Xiao","Ti","Qun","Kui","Wei","Huan","Lu","Chuan","Huang","Qiu","Xia",
                "Ao","Gou","Ta","Liu","Xian","Lin","Ju","Xie","Miao","Sui","La","Ji","Hui","Tuan","Zhi","Kao",
                "Zhi","Ji","E","Chan","Xi","Ju","Chan","Jing","Nu","Mi","Fu","Bi","Yu","Che","Shuo","Fei",
                "Yan","Wu","Yu","Bi","Jin","Zi","Gui","Niu","Yu","Si","Da","Zhou","Shan","Qie","Ya","Rao",
                "Shu","Luan","Jiao","Pin","Cha","Li","Ping","Wa","Xian","Suo","Di","Wei","E","Jing","Biao","Jie",
                "Chang","Bi","Chan","Nu","Ao","Yuan","Ting","Wu","Gou","Mo","Pi","Ai","Pin","Chi","Li","Yan",
                "Qiang","Piao","Chang","Lei","Zhang","Xi","Shan","Bi","Niao","Mo","Shuang","Ga","Ga","Fu","Nu","Zi",
                "Jie","Jue","Bao","Zang","Si","Fu","Zou","Yi","Nu","Dai","Xiao","Hua","Pian","Li","Qi","Ke",
                "Zhui","Can","Zhi","Wu","Ao","Liu","Shan","Biao","Cong","Chan","Ji","Xiang","Jiao","Yu","Zhou","Ge",
                "Wan","Kuang","Yun","Pi","Shu","Gan","Xie","Fu","Zhou","Fu","Chu","Dai","Ku","Hang","Jiang","Geng",
                "Xiao","Ti","Ling","Qi","Fei","Shang","Gun","Duo","Shou","Liu","Quan","Wan","Zi","Ke","Xiang","Ti",
                "Miao","Hui","Si","Bian","Gou","Zhui","Min","Jin","Zhen","Ru","Gao","Li","Yi","Jian","Bin","Piao",
                "Man","Lei","Miao","Sao","Xie","Liao","Zeng","Jiang","Qian","Qiao","Huan","Zuan","Yao","Ji","Chuan","Zai",
                "Yong","Ding","Ji","Wei","Bin","Min","Jue","Ke","Long","Dian","Dai","Po","Min","Jia","Er","Gong",
                "Xu","Ya","Heng","Yao","Luo","Xi","Hui","Lian","Qi","Ying","Qi","Hu","Kun","Yan","Cong","Wan",
                "Chen","Ju","Mao","Yu","Yuan","Xia","Nao","Ai","Tang","Jin","Huang","Ying","Cui","Cong","Xuan","Zhang",
                "Pu","Can","Qu","Lu","Bi","Zan","Wen","Wei","Yun","Tao","Wu","Shao","Qi","Cha","Ma","Li",
                "Pi","Miao","Yao","Rui","Jian","Chu","Cheng","Cong","Xiao","Fang","Pa","Zhu","Nai","Zhi","Zhe","Long",
                "Jiu","Ping","Lu","Xia","Xiao","You","Zhi","Tuo","Zhi","Ling","Gou","Di","Li","Tuo","Cheng","Kao",
                "Lao","Ya","Rao","Zhi","Zhen","Guang","Qi","Ting","Gua","Jiu","Hua","Heng","Gui","Jie","Luan","Juan",
                "An","Xu","Fan","Gu","Fu","Jue","Zi","Suo","Ling","Chu","Fen","Du","Qian","Zhao","Luo","Chui",
                "Liang","Guo","Jian","Di","Ju","Cou","Zhen","Nan","Zha","Lian","Lan","Ji","Pin","Ju","Qiu","Duan",
                "Chui","Chen","Lv","Cha","Ju","Xuan","Mei","Ying","Zhen","Fei","Ta","Sun","Xie","Gao","Cui","Gao",
                "Shuo","Bin","Rong","Zhu","Xie","Jin","Qiang","Qi","Chu","Tang","Zhu","Hu","Gan","Yue","Qing","Tuo",
                "Jue","Qiao","Qin","Lu","Zun","Xi","Ju","Yuan","Lei","Yan","Lin","Bo","Cha","You","Ao","Mo",
                "Cu","Shang","Tian","Yun","Lian","Piao","Dan","Ji","Bin","Yi","Ren","E","Gu","Ke","Lu","Zhi",
                "Yi","Zhen","Hu","Li","Yao","Shi","Zhi","Quan","Lu","Zhe","Nian","Wang","Chuo","Zi","Cou","Lu",
                "Lin","Wei","Jian","Qiang","Jia","Ji","Ji","Kan","Deng","Gai","Jian","Zang","Ou","Ling","Bu","Beng",
                "Zeng","Pi","Po","Ga","La","Gan","Hao","Tan","Gao","Ze","Xin","Yun","Gui","He","Zan","Mao",
                "Yu","Chang","Ni","Qi","Sheng","Ye","Chao","Yan","Hui","Bu","Han","Gui","Xuan","Kui","Ai","Ming",
                "Tun","Xun","Yao","Xi","Nang","Ben","Shi","Kuang","Yi","Zhi","Zi","Gai","Jin","Zhen","Lai","Qiu",
                "Ji","Dan","Fu","Chan","Ji","Xi","Di","Yu","Gou","Jin","Qu","Jian","Jiang","Pin","Mao","Gu",
                "Wu","Gu","Ji","Ju","Jian","Pian","Kao","Qie","Suo","Bai","Ge","Bo","Mao","Mu","Cui","Jian",
                "San","Shu","Chang","Lu","Pu","Qu","Pie","Dao","Xian","Chuan","Dong","Ya","Yin","Ke","Yun","Fan",
                "Chi","Jiao","Du","Die","You","Yuan","Guo","Yue","Wo","Rong","Huang","Jing","Ruan","Tai","Gong","Zhun",
                "Na","Yao","Qian","Long","Dong","Ka","Lu","Jia","Shen","Zhou","Zuo","Gua","Zhen","Qu","Zhi","Jing",
                "Guang","Dong","Yan","Kuai","Sa","Hai","Pian","Zhen","Mi","Tun","Luo","Cuo","Pao","Wan","Niao","Jing",
                "Yan","Fei","Yu","Zong","Ding","Jian","Cou","Nan","Mian","Wa","E","Shu","Cheng","Ying","Ge","Lv",
                "Bin","Teng","Zhi","Chuai","Gu","Meng","Sao","Shan","Lian","Lin","Yu","Xi","Qi","Sha","Xin","Xi",
                "Biao","Sa","Ju","Sou","Biao","Biao","Shu","Gou","Gu","Hu","Fei","Ji","Lan","Yu","Pei","Mao",
                "Zhan","Jing","Ni","Liu","Yi","Yang","Wei","Dun","Qiang","Shi","Hu","Zhu","Xuan","Tai","Ye","Yang",
                "Wu","Han","Men","Chao","Yan","Hu","Yu","Wei","Duan","Bao","Xuan","Bian","Tui","Liu","Man","Shang",
                "Yun","Yi","Yu","Fan","Sui","Xian","Jue","Cuan","Huo","Tao","Xu","Xi","Li","Hu","Jiong","Hu",
                "Fei","Shi","Si","Xian","Zhi","Qu","Hu","Fu","Zuo","Mi","Zhi","Ci","Zhen","Tiao","Qi","Chan",
                "Xi","Zhuo","Xi","Rang","Te","Tan","Dui","Jia","Hui","Nv","Nin","Yang","Zi","Que","Qian","Min",
                "Te","Qi","Dui","Mao","Men","Gang","Yu","Yu","Ta","Xue","Miao","Ji","Gan","Dang","Hua","Che",
                "Dun","Ya","Zhuo","Bian","Feng","Fa","Ai","Li","Long","Zha","Tong","Di","La","Tuo","Fu","Xing",
                "Mang","Xia","Qiao","Zhai","Dong","Nao","Ge","Wo","Qi","Dui","Bei","Ding","Chen","Zhou","Jie","Di",
                "Xuan","Bian","Zhe","Gun","Sang","Qing","Qu","Dun","Deng","Jiang","Ca","Meng","Bo","Kan","Zhi","Fu",
                "Fu","Xu","Mian","Kou","Dun","Miao","Dan","Sheng","Yuan","Yi","Sui","Zi","Chi","Mou","Lai","Jian",
                "Di","Suo","Ya","Ni","Sui","Pi","Rui","Sou","Kui","Mao","Ke","Ming","Piao","Cheng","Kan","Lin",
                "Gu","Ding","Bi","Quan","Tian","Fan","Zhen","She","Wan","Tuan","Fu","Gang","Gu","Li","Yan","Pi",
                "Lan","Li","Ji","Zeng","He","Guan","Juan","Jin","Ga","Yi","Po","Zhao","Liao","Tu","Chuan","Shan",
                "Men","Chai","Nv","Bu","Tai","Ju","Ban","Qian","Fang","Kang","Dou","Huo","Ba","Yu","Zheng","Gu",
                "Ke","Po","Bu","Bo","Yue","Mu","Tan","Dian","Shuo","Shi","Xuan","Ta","Bi","Ni","Pi","Duo",
                "Kao","Lao","Er","You","Cheng","Jia","Nao","Ye","Cheng","Diao","Yin","Kai","Zhu","Ding","Diu","Hua",
                "Quan","Ha","Sha","Diao","Zheng","Se","Chong","Tang","An","Ru","Lao","Lai","Te","Keng","Zeng","Li",
                "Gao","E","Cuo","Lve","Liu","Kai","Jian","Lang","Qin","Ju","A","Qiang","Nuo","Ben","De","Ke",
                "Kun","Gu","Huo","Pei","Juan","Tan","Zi","Qie","Kai","Si","E","Cha","Sou","Huan","Ai","Lou",
                "Qiang","Fei","Mei","Mo","Ge","Juan","Na","Liu","Yi","Jia","Bin","Biao","Tang","Man","Luo","Yong",
                "Chuo","Xuan","Di","Tan","Jue","Pu","Lu","Dui","Lan","Pu","Cuan","Qiang","Deng","Huo","Zhuo","Yi",
                "Cha","Biao","Zhong","Shen","Cuo","Zhi","Bi","Zi","Mo","Shu","Lv","Ji","Fu","Lang","Ke","Ren",
                "Zhen","Ji","Se","Nian","Fu","Rang","Gui","Jiao","Hao","Xi","Po","Die","Hu","Yong","Jiu","Yuan",
                "Bao","Zhen","Gu","Dong","Lu","Qu","Chi","Si","Er","Zhi","Gua","Xiu","Luan","Bo","Li","Hu",
                "Yu","Xian","Ti","Wu","Miao","An","Bei","Chun","Hu","E","Ci","Mei","Wu","Yao","Jian","Ying",
                "Zhe","Liu","Liao","Jiao","Jiu","Yu","Hu","Lu","Guan","Bing","Ding","Jie","Li","Shan","Li","You",
                "Gan","Ke","Da","Zha","Pao","Zhu","Xuan","Jia","Ya","Yi","Zhi","Lao","Wu","Cuo","Xian","Sha",
                "Zhu","Fei","Gu","Wei","Yu","Yu","Dan","La","Yi","Hou","Chai","Lou","Jia","Sao","Chi","Mo",
                "Ban","Ji","Huang","Biao","Luo","Ying","Zhai","Long","Yin","Chou","Ban","Lai","Yi","Dian","Pi","Dian",
                "Qu","Yi","Song","Xi","Qiong","Zhun","Bian","Yao","Tiao","Dou","Ke","Yu","Xun","Ju","Yu","Yi",
                "Cha","Na","Ren","Jin","Mei","Pan","Dang","Jia","Ge","Ken","Lian","Cheng","Lian","Jian","Biao","Chu",
                "Ti","Bi","Ju","Duo","Da","Bei","Bao","Lv","Bian","Lan","Chi","Zhe","Qiang","Ru","Pan","Ya",
                "Xu","Jun","Cun","Jin","Lei","Zi","Chao","Si","Huo","Lao","Tang","Ou","Lou","Jiang","Nou","Mo",
                "Die","Ding","Dan","Ling","Ning","Guo","Kui","Ao","Qin","Han","Qi","Hang","Jie","He","Ying","Ke",
                "Han","E","Zhuan","Nie","Man","Sang","Hao","Ru","Pin","Hu","Qian","Qiu","Ji","Chai","Hui","Ge",
                "Meng","Fu","Pi","Rui","Xian","Hao","Jie","Gong","Dou","Yin","Chi","Han","Gu","Ke","Li","You",
                "Ran","Zha","Qiu","Ling","Cheng","You","Qiong","Jia","Nao","Zhi","Si","Qu","Ting","Kuo","Qi","Jiao",
                "Yang","Mou","Shen","Zhe","Shao","Wu","Li","Chu","Fu","Qiang","Qing","Qi","Xi","Yu","Fei","Guo",
                "Guo","Yi","Pi","Tiao","Quan","Wan","Lang","Meng","Chun","Rong","Nan","Fu","Kui","Ke","Fu","Sou",
                "Yu","You","Lou","You","Bian","Mou","Qin","Ao","Man","Mang","Ma","Yuan","Xi","Chi","Tang","Pang",
                "Shi","Huang","Cao","Piao","Tang","Xi","Xiang","Zhong","Zhang","Shuai","Mao","Peng","Hui","Pan","Shan","Huo",
                "Meng","Chan","Lian","Mie","Li","Du","Qu","Fou","Ying","Qing","Xia","Shi","Zhu","Yu","Ji","Du",
                "Ji","Jian","Zhao","Zi","Hu","Qiong","Po","Da","Sheng","Ze","Gou","Li","Si","Tiao","Jia","Bian",
                "Chi","Kou","Bi","Xian","Yan","Quan","Zheng","Jun","Shi","Gang","Pa","Shao","Xiao","Qing","Ze","Qie",
                "Zhu","Ruo","Qian","Tuo","Bi","Dan","Kong","Wan","Xiao","Zhen","Kui","Huang","Hou","Gou","Fei","Li",
                "Bi","Chi","Su","Mie","Dou","Lu","Duan","Gui","Dian","Zan","Deng","Bo","Lai","Zhou","Yu","Yu",
                "Chong","Xi","Nie","Nv","Chuan","Shan","Yi","Bi","Zhong","Ban","Fang","Ge","Lu","Zhu","Ze","Xi",
                "Shao","Wei","Meng","Shou","Cao","Chong","Meng","Qin","Niao","Jia","Qiu","Sha","Bi","Di","Qiang","Suo",
                "Jie","Tang","Xi","Xian","Mi","Ba","Li","Tiao","Xi","Zi","Can","Lin","Zong","San","Hou","Zan",
                "Ci","Xu","Rou","Qiu","Jiang","Gen","Ji","Yi","Ling","Xi","Zhu","Fei","Jian","Pian","He","Yi",
                "Jiao","Zhi","Qi","Qi","Yao","Dao","Fu","Qu","Jiu","Ju","Lie","Zi","Zan","Nan","Zhe","Jiang",
                "Chi","Ding","Gan","Zhou","Yi","Gu","Zuo","Tuo","Xian","Ming","Zhi","Yan","Shai","Cheng","Tu","Lei",
                "Kun","Pei","Hu","Ti","Xu","Hai","Tang","Lao","Bu","Jiao","Xi","Ju","Li","Xun","Shi","Cuo",
                "Dun","Qiong","Xue","Cu","Bie","Bo","Ta","Jian","Fu","Qiang","Zhi","Fu","Shan","Li","Tuo","Jia",
                "Bo","Tai","Kui","Qiao","Bi","Xian","Xian","Ji","Jiao","Liang","Ji","Chuo","Huai","Chi","Zhi","Dian",
                "Bo","Zhi","Jian","Die","Chuai","Zhong","Ju","Duo","Cuo","Pian","Rou","Nie","Pan","Qi","Chu","Jue",
                "Pu","Fan","Cu","Zhu","Lin","Chan","Lie","Zuan","Xie","Zhi","Diao","Mo","Xiu","Mo","Pi","Hu",
                "Jue","Shang","Gu","Zi","Gong","Su","Zhi","Zi","Qing","Liang","Yu","Li","Wen","Ting","Ji","Pei",
                "Fei","Sha","Yin","Ai","Xian","Mai","Chen","Ju","Bao","Tiao","Zi","Yin","Yu","Chuo","Wo","Mian",
                "Yuan","Tuo","Zhui","Sun","Jun","Ju","Luo","Qu","Chou","Qiong","Luan","Wu","Zan","Mou","Ao","Liu",
                "Bei","Xin","You","Fang","Ba","Ping","Nian","Lu","Su","Fu","Hou","Tai","Gui","Jie","Wei","Er",
                "Ji","Jiao","Xiang","Xun","Geng","Li","Lian","Jian","Shi","Tiao","Gun","Sha","Huan","Ji","Qing","Ling",
                "Zou","Fei","Kun","Chang","Gu","Ni","Nian","Diao","Shi","Zi","Fen","Die","E","Qiu","Fu","Huang",
                "Bian","Sao","Ao","Qi","Ta","Guan","Yao","Le","Biao","Xue","Man","Min","Yong","Gui","Shan","Zun",
                "Li","Da","Yang","Da","Qiao","Man","Jian","Ju","Rou","Gou","Bei","Jie","Tou","Ku","Gu","Di",
                "Hou","Ge","Ke","Bi","Lou","Qia","Kuan","Bin","Du","Mei","Ba","Yan","Liang","Xiao","Wang","Chi",
                "Xiang","Yan","Tie","Tao","Yong","Biao","Kun","Mao","Ran","Tiao","Ji","Zi","Xiu","Quan","Jiu","Bin",
                "Huan","Lie","Me","Hui","Mi","Ji","Jun","Zhu","Mi","Qi","Ao","She","Lin","Dai","Chu","You",
                "Xia","Yi","Qu","Du","Li","Qing","Can","An","Fen","You","Wu","Yan","Xi","Qiu","Han","Zha"
           };
        #endregion ¶ş¼¶ºº×Ö
        #region ±äÁ¿¶¨Òå
        // GB2312-80 ±ê×¼¹æ·¶ÖĞµÚÒ»¸öºº×ÖµÄ»úÄÚÂë.¼´"°¡"µÄ»úÄÚÂë
        private const int FirstChCode = -20319;
        // GB2312-80 ±ê×¼¹æ·¶ÖĞ×îºóÒ»¸öºº×ÖµÄ»úÄÚÂë.¼´"÷ş"µÄ»úÄÚÂë
        private const int LastChCode = -2050;
        // GB2312-80 ±ê×¼¹æ·¶ÖĞ×îºóÒ»¸öÒ»¼¶ºº×ÖµÄ»úÄÚÂë.¼´"×ù"µÄ»úÄÚÂë
        private const int LastOfOneLevelChCode = -10247;
        // ÅäÖÃÖĞÎÄ×Ö·û
        //static Regex regex = new Regex("[\u4e00-\u9fa5]$");

        #endregion
        #endregion

        #region µÃµ½ÊäÈëÎÄ×ÖµÄµÚÒ»¸öÆ´Òô
        /// <summary>
        /// µÃµ½ÊäÈëÎÄ×ÖµÄµÚÒ»¸öÆ´Òô
        /// </summary>        
        /// <param name="ch"></param>
        /// <returns></returns>        
        public static String GetFirstCharacters(this Char ch)
        {
            var rs = ch.GetFirstRuby();
            if (!String.IsNullOrEmpty(rs)) rs = rs.Substring(0, 1);

            return rs;
        }
        #endregion

        #region È¡Æ´ÒôµÚÒ»¸ö×Ö¶Î----×Ö·û´®

        /// <summary>
        /// È¡Æ´ÒôµÚÒ»¸ö×Ö¶Î
        /// </summary>
        /// <param name="str">
        /// </param>
        /// <returns></returns>
        public static String GetFirstString(this String str)
        {
            if (String.IsNullOrEmpty(str)) return String.Empty;
            var sb = new StringBuilder(str.Length + 1);
            var chs = str.ToCharArray();

            foreach (char t in chs)
            {
                sb.Append(t.GetFirstCharacters());
            }

            return sb.ToString();
        }
        #endregion

        #region »ñÈ¡µ¥×ÖÆ´Òô

        /// <summary>
        /// »ñÈ¡µ¥×ÖÆ´Òô
        /// </summary>
        /// <param name="ch">
        /// </param>
        /// <returns></returns>
        public static String GetFirstRuby(this Char ch)
        {
            // À­¶¡×Ö·û            
            if (ch <= '\x00FF') return ch.ToString();

            // ±êµã·ûºÅ¡¢·Ö¸ô·û            
            if (Char.IsPunctuation(ch) || Char.IsSeparator(ch)) return ch.ToString();

            // ·ÇÖĞÎÄ×Ö·û            
            if (ch < '\x4E00' || ch > '\x9FA5') return ch.ToString();

            var arr = Encoding.GetEncoding("gb2312").GetBytes(ch.ToString());
            //Encoding.DefaultÄ¬ÈÏÔÚÖĞÎÄ»·¾³ÀïËäÊÇGB2312£¬µ«ÔÚ¶à±äµÄ»·¾³¿ÉÄÜÊÇÆäËü
            //var arr = Encoding.Default.GetBytes(ch.ToString()); 
            var chr = arr[0] * 256 + arr[1] - 65536;

            //***// µ¥×Ö·û--Ó¢ÎÄ»ò°ë½Ç×Ö·û  
            if (chr > 0 && chr < 160) return ch.ToString();
            #region ÖĞÎÄ×Ö·û´¦Àí

            // ÅĞ¶ÏÊÇ·ñ³¬¹ıGB2312-80±ê×¼ÖĞµÄºº×Ö·¶Î§
            if (chr > LastChCode || chr < FirstChCode)
            {
                return ch.ToString();
            }
            // Èç¹ûÊÇÔÚÒ»¼¶ºº×ÖÖĞ
            else if (chr <= LastOfOneLevelChCode)
            {
                // ½«Ò»¼¶ºº×Ö·ÖÎª12¿é,Ã¿¿é33¸öºº×Ö.
                for (int aPos = 11; aPos >= 0; aPos--)
                {
                    int aboutPos = aPos * 33;
                    // ´Ó×îºóµÄ¿é¿ªÊ¼É¨Ãè,Èç¹û»úÄÚÂë´óÓÚ¿éµÄµÚÒ»¸ö»úÄÚÂë,ËµÃ÷ÔÚ´Ë¿éÖĞ
                    if (chr >= PyValue[aboutPos])
                    {
                        // Console.WriteLine("´æÔÚÓÚµÚ " + aPos.ToString() + " ¿é,´Ë¿éµÄµÚÒ»¸ö»úÄÚÂëÊÇ: " + PyValue[aPos * 33].ToString());
                        // ±éÀú¿éÖĞµÄÃ¿¸öÒô½Ú»úÄÚÂë,´Ó×îºóµÄÒô½Ú»úÄÚÂë¿ªÊ¼É¨Ãè,
                        // Èç¹ûÒô½ÚÄÚÂëĞ¡ÓÚ»úÄÚÂë,ÔòÈ¡´ËÒô½Ú
                        for (int i = aboutPos + 32; i >= aboutPos; i--)
                        {
                            if (PyValue[i] <= chr)
                            {
                                // Console.WriteLine("ÕÒµ½µÚÒ»¸öĞ¡ÓÚÒª²éÕÒ»úÄÚÂëµÄ»úÄÚÂë: " + PyValue[i].ToString());
                                return PyName[i];
                            }
                        }
                        break;
                    }
                }
            }
            // Èç¹ûÊÇÔÚ¶ş¼¶ºº×ÖÖĞ
            else
            {
                int pos = Array.IndexOf(OtherChinese, ch.ToString());
                if (pos != decimal.MinusOne)
                {
                    return OtherPinYin[pos];
                }
            }
            #endregion ÖĞÎÄ×Ö·û´¦Àí

            return String.Empty;
        }
        #endregion

        #region °Ñºº×Ö×ª»»³ÉÆ´Òô(È«Æ´)
        /// <summary>
        /// °Ñºº×Ö×ª»»³ÉÆ´Òô(È«Æ´)
        /// </summary>
        /// <param name="str">ºº×Ö×Ö·û´®</param>
        /// <returns>×ª»»ºóµÄÆ´Òô(È«Æ´)×Ö·û´®</returns>
        public static String GetFullRuby(this String str)
        {
            if (String.IsNullOrEmpty(str)) return String.Empty;

            var sb = new StringBuilder(str.Length * 10);
            var chs = str.ToCharArray();

            foreach (char t in chs)
            {
                sb.Append(t.GetFirstRuby());
            }

            return sb.ToString();
        }
        #endregion

    }
}